# SpotSlopeReferenceIsVertical Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DimensionFailures..::..SpotSlopeReferenceIsVertical Property
BuiltInFailures..::..DimensionFailures Class See Also
---
The highlighted Spot Slope references an element that is vertical.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId SpotSlopeReferenceIsVertical { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SpotSlopeReferenceIsVertical As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ SpotSlopeReferenceIsVertical {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DimensionFailures Class
Autodesk.Revit.DB Namespace